%%清空
clear; clc;
%%条件
process_time=[3 4 1 2 6 1 4 7 5 2 1 1 1 3 5 2 4 6 5 1 3 1 5 6 3 2]; %对应产品批次的加工时间（天）

deadline_early0=[5 9 3 12 10 24 5 6 6 10 15 15 20 20 20 25 28 30 30 30 60 60 75 90 120 120];  %30天后加入新工厂对应产品批次的交货期限
deadline_early1=[5 9 3 12 10 24 5 6 6 10 15 15 20 20 20 25 28 32 32 32 62 62 77 92 122 122];  %29天后加入新工厂对应产品批次的交货期限
deadline_early2=[5 9 3 12 10 24 5 6 6 10 15 15 20 20 20 25 28 34 34 34 64 64 79 94 124 124];  %28天后加入新工厂对应产品批次的交货期限
deadline_early3=[5 9 3 12 10 24 5 6 6 10 15 15 20 20 20 25 30 36 36 36 66 66 81 96 126 126];  %27天后加入新工厂对应产品批次的交货期限
deadline_early4=[5 9 3 12 10 24 5 6 6 10 15 15 20 20 20 25 32 38 38 38 68 68 83 98 128 128];  %26天后加入新工厂对应产品批次的交货期限
deadline_early5=[5 9 3 12 10 24 5 6 6 10 15 15 20 20 20 25 34 40 40 40 70 70 85 100 130 130];  %26天后加入新工厂对应产品批次的交货期限
%%设定初始解（MonteCarlo法）
pop=randperm(26)